#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github.github_team.gesasso_new will be created
  + resource "github_team" "gesasso_new" {
      + description = "L'outil de gestion des assos au SiMDE"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Gesasso"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # module.github.module.repositories.github_branch_protection.gesasso_mkmail_master will be created
  + resource "github_branch_protection" "gesasso_mkmail_master" {
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "main"
      + push_restrictions      = [
          + "MDQ6VGVhbTQyMTc3MzM=",
        ]
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "MDQ6VGVhbTQyMTc3MzM=",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.github.module.repositories.github_repository.gesasso_mkmail will be created
  + resource "github_repository" "gesasso_mkmail" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Le nécessaire pour les mails"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "gesasso_mkmail"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.module.repositories.github_team_repository.gesasso_mkmail_gesasso_mkmail will be created
  + resource "github_team_repository" "gesasso_mkmail_gesasso_mkmail" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkmail"
      + team_id    = (known after apply)
    }

  # module.github.module.repositories.github_team_repository.simde_gesasso_mkmail will be created
  + resource "github_team_repository" "simde_gesasso_mkmail" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkmail"
      + team_id    = "4217733"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @noeamiot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*